coq/src/Hacspec_Piggybank.v
(* [[file:piggybank.org::* piggybank - Coq code][piggybank - Coq code:1]] *)
